Autodesk.Revit.DB.IndependentTag.GetTaggedReferences
Get the host references of the tag.
Remarks:
The references can be to an element or subelement in a local or linked document.
Since:
2022

Autodesk.Revit.DB.IndependentTag.RemoveReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Removes the provided list of references from the tag's list of references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all tagged before removing them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.AddReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds the provided list of references to the tag's list of references.
Remarks:
The references must pass the following requirements to be added:
Must not be already tagged.Must be of the same category when TagMode is TM_ADDBY_CATEGORY.Must be taggable by this tag type.
If any of the above rules is not fulfilled, the execution will be stopped and an exception will be thrown
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all taggable and that they are not already tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This type of tag does not support multiple references.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderEnd(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader end because the tag does not use a free end leader.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderEnd(Autodesk.Revit.DB.Reference)
Returns the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader end because the tag does not use a free end leader.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderElbow(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the position of the elbow of the tag's leader that points to specified reference.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The tag does not have a leader.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderElbow(Autodesk.Revit.DB.Reference)
Returns the position of the elbow of the tag's leader that points to specified reference.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference does not have a leader or its leader is straight.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.HasLeaderElbow(Autodesk.Revit.DB.Reference)
Whether the tag's leader that points to the reference has an elbow point or not.
Returns:
True if the reference has a leader with an elbow point, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The tag does not have a leader.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetTaggedElementIds
Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each
subelement that is being referenced by the tag.
Remarks:
All the returned LinkElementIds will be valid even when Autodesk.Revit.DB.IndependentTag.IsOrphaned is true.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetTaggedLocalElementIds
Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each
subelement that is being referenced by the tag.
Since:
2022

Autodesk.Revit.DB.IndependentTag.LeaderEnd
The position of the leader end for a tag using free end leader behavior.
Remarks:
Tags with attached leaders or no leaders do not report leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader end because the tag does not use a free end leader.

Autodesk.Revit.DB.IndependentTag.LeaderElbow
The position of the elbow of the tag's leader.
Remarks:
Straight leaders do not have elbow points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The tag does not have a leader or its leader is straight.
-or-
When setting this property: The tag does not have a leader.

Autodesk.Revit.DB.IndependentTag.TaggedElementId
The LinkElementId of the tagged element, if any. If the tag is tagged on a subelement of linked element, it returns the LinkElementId of the element.
Remarks:
The ID of the tagged element.  If there is no tagged element because the tag Autodesk.Revit.DB.IndependentTag.IsOrphaned then LinkElementId.HostElementId, LinkElementId.LinkElementId and LinkElementId.LinkInstanceId will be InvalidElementId.